[
  {
    "id": "best-fluffy-pancake-recipe",
    "title": "Best Fluffy Pancake Recipe",
    "description": "Get ready to make the most incredible fluffy pancakes yet with my step-by-step secrets that make this recipe foolproof!",
    "prepTime": "5 min",
    "cookTime": "10 min",
    "servings": "6",
    "image": "https://www.laurafuentes.com/wp-content/uploads/2018/09/Fluffy-pancakes-RC.jpg",
    "tags": [],
    "ingredients": [
      "1 1/2 cups all-purpose flour",
      "2 1/2 teaspoons baking powder (aluminum-free )",
      "1/2 teaspoon salt",
      "1 tablespoon sugar",
      "1 1/4 cups milk (any)",
      "1  egg",
      "3 tablespoons butter (melted)",
      "2 teaspoons vanilla extract (optional)"
    ],
    "instructions": [
      "Make the batter::",
      "In a large bowl, sift together the flour, baking powder, salt, and sugar. Make a well in the middle and pour in the milk, egg, butter, and vanilla extract (if using it to add flavor). Break up the egg first with a fork, and then begin to combine the flour, working from the outside of the bowl in, until just combined and mostly smooth.",
      "Cook the pancakes::",
      "Heat a non-stick griddle or large pan over medium-high heat. Once hot, grease, spray, or melt butter on the hot surface. When using an electric griddle, heat it somewhere between 300 and 350F.",
      "Immediately, pour ¼ cup of pancake batter onto the greased pan. Cook the pancakes for about 2 minutes, until the edges begin to look defined and bubbles form. Flip the pancakes over and cook for another minute on the other side. Avoid pressing down on the pancake after flipping; this will cause denser and chewy pancakes and undercooked batter as it oozes out on the sides. Remove the pancakes from the pan onto a plate and keep them warm while you cook the rest of the batter.",
      "Serve::",
      "Plate a few pancakes on a plate, top with your favorite toppings and syrups."
    ],
    "notes": "",
    "sourceUrl": "https://www.laurafuentes.com/fluffy-pancakes-recipe/#recipe",
    "dateAdded": "2025-10-25"
  },
  {
    "id": "nikujaga-japanese-beef-stew",
    "title": "Nikujaga (Japanese Beef Stew)",
    "description": "",
    "prepTime": "10 min",
    "cookTime": "20 min",
    "servings": "4",
    "image": "https://www.closetcooking.com/wp-content/uploads/2008/10/Nikujaga-500.jpg",
    "tags": [],
    "ingredients": [
      "1 tablespoon oil",
      "1 pound beef (thinly sliced or cut into bite sized pieces)",
      "1 onion (sliced)",
      "2 cups potatoes (or pumpkin cut into bite sized pieces)",
      "1 carrot (cut into bite sized pieces)",
      "2 cupsdashi(or water or beef stock)",
      "3 tablespoons soy",
      "3 tablespoon sugar",
      "2 tablespoon sake",
      "1 tablespoon mirin",
      "1 green onion (sliced)",
      "shichimi togarashi to taste (optional)"
    ],
    "instructions": [
      "Heat the oil in a pan.",
      "Add the beef and brown on all sides.",
      "Add the onion, squash and carrot and saute for 5 minutes.",
      "Add the dashi, soy, sugar, sake and mirin, cover and simmer until the vegetables are tender."
    ],
    "notes": "",
    "sourceUrl": "https://www.closetcooking.com/nikujaga-japanese-beef-stew/",
    "dateAdded": "2025-10-25"
  },
  {
    "id": "tomato-garlic-confit-roasted-cherry-tomatoes",
    "title": "Tomato Garlic Confit (Roasted Cherry Tomatoes)",
    "description": "This cherry tomato confit recipe takes only 5 minutes of hands-on time before transforming in your oven, into the most tender, juicy little heavenly bites.",
    "prepTime": "10 min",
    "cookTime": "60 min",
    "servings": "4 servings",
    "image": "https://www.feastingathome.com/wp-content/uploads/2024/09/Tomato-Confit-6-225x225.jpg",
    "tags": [],
    "ingredients": [
      "2 pints cherry tomatoes, grape tomatoes, yellow pear tomatoes or a mix (about 4 cups)",
      "¼ cup extra virgin olive oil (please see notes)",
      "¾ teaspoon salt, more to taste",
      "½ teaspoon black pepper",
      "6-8 fat garlic cloves, smashed",
      "Optional: 4-5 fresh thyme sprigs (or sub oregano) and 8-10 fresh basil leaves, a splash of balsamic vinegar"
    ],
    "instructions": [
      "Preheat the oven to 350 F",
      "Place the tomatoes and smashed fresh garlic cloves in a mostly single layer in a 9×13 inch baking dish, 11-inch braiser, or oven-proof skillet.",
      "Add the olive oil ( see notes) and thyme sprigs and season with salt and pepper. Cover tightly with a lid or with foil.",
      "Bake for 60 minutes, giving the pan a little shake halfway through. At 60 minutes, the tomatoes should have collapsed slightly, and the garlic should be caramelized. If you like them a little more caramelized, roast uncovered for 10-15 more minutes. If preserving for later, add ¼ cup more oil to the pan. Remove from oven and let cool for 10 minutes before adding basil leaves.",
      "Taste, adjust salt and pepper.",
      "Serve right away (with a drizzle of balsamic if you like) or store in an airtight container or jar for up to 2 weeks in the refrigerator, covered with the reserved oil. If the tomatoes are exposed to air, they can mold, so be sure to sink them down."
    ],
    "notes": "",
    "sourceUrl": "https://www.feastingathome.com/tomato-confit/#tasty-recipes-80247-jump-target",
    "dateAdded": "2025-10-26"
  }
]