[
  {
    "id": "best-fluffy-pancake-recipe",
    "title": "Best Fluffy Pancake Recipe",
    "description": "I was craving thick, fluffy pancakes one morning and decided to try this highly rated recipe I found online. It turned out just as good as I’d hoped!",
    "prepTime": "5 min",
    "cookTime": "10 min",
    "servings": "6",
    "image": "https://www.laurafuentes.com/wp-content/uploads/2018/09/Fluffy-pancakes-RC.jpg",
    "tags": [],
    "ingredients": [
      "1 1/2 cups all-purpose flour",
      "2 1/2 teaspoons baking powder (aluminum-free )",
      "1/2 teaspoon salt",
      "1 tablespoon sugar",
      "1 1/4 cups milk (any)",
      "1  egg",
      "3 tablespoons butter (melted)",
      "2 teaspoons vanilla extract (optional)"
    ],
    "instructions": [
      "In a large bowl, sift together the flour, baking powder, salt, and sugar. Make a well in the middle and pour in the milk, egg, butter, and vanilla extract (if using it to add flavor). Break up the egg first with a fork, and then begin to combine the flour, working from the outside of the bowl in, until just combined and mostly smooth.",
      "Heat a non-stick griddle or large pan over medium-high heat. Once hot, grease, spray, or melt butter on the hot surface. When using an electric griddle, heat it somewhere between 300 and 350F.",
      "Pour ¼ cup of pancake batter onto the greased pan. Cook the pancakes for about 2 minutes, until the edges begin to look defined and bubbles form. Flip the pancakes over and cook for another minute on the other side. Avoid pressing down on the pancake after flipping; this will cause denser and chewy pancakes and undercooked batter as it oozes out on the sides. Remove the pancakes from the pan onto a plate and keep them warm while you cook the rest of the batter.",
      "Plate a few pancakes on a plate, top with your favorite toppings and syrups."
    ],
    "notes": "",
    "sourceUrl": "https://www.laurafuentes.com/fluffy-pancakes-recipe/#recipe",
    "dateAdded": "2025-10-25"
  },
  {
    "id": "nikujaga-japanese-beef-stew",
    "title": "Nikujaga (Japanese Beef Stew)",
    "description": "This is my go-to lazy beef stew. Everything goes straight into the Instant Pot, no fuss required. Just set it to HIGH for 25 minutes, and you’ll have a rich, comforting stew ready before you know it.",
    "prepTime": "10 min",
    "cookTime": "20 min",
    "servings": "4",
    "image": "https://www.closetcooking.com/wp-content/uploads/2008/10/Nikujaga-500.jpg",
    "tags": [],
    "ingredients": [
      "1 tablespoon oil",
      "1 pound beef (thinly sliced or cut into bite sized pieces)",
      "1 onion (sliced)",
      "2 cups potatoes (or pumpkin cut into bite sized pieces)",
      "1 carrot (cut into bite sized pieces)",
      "2 cupsdashi(or water or beef stock)",
      "3 tablespoons soy",
      "3 tablespoon sugar",
      "2 tablespoon sake",
      "1 tablespoon mirin",
      "1 green onion (sliced)",
      "shichimi togarashi to taste (optional)"
    ],
    "instructions": [
      "Heat the oil in a pan.",
      "Add the beef and brown on all sides.",
      "Add the onion, squash and carrot and saute for 5 minutes.",
      "Add the dashi, soy, sugar, sake and mirin, cover and simmer until the vegetables are tender."
    ],
    "notes": "",
    "sourceUrl": "https://www.closetcooking.com/nikujaga-japanese-beef-stew/",
    "dateAdded": "2025-10-25"
  },
  {
    "id": "tomato-garlic-confit-roasted-cherry-tomatoes",
    "title": "Tomato Garlic Confit (Roasted Cherry Tomatoes)",
    "description": "With the big harvest of our Sun Gold, Sun Sugar, and Sun Cherry tomatoes this season, I needed a way to use them all. Slow-roasting them into a rich, flavorful tomato confit turned out to be the perfect solution. I also mix in fresh leaves from my indoor-grown basil, which add a bright, fragrant finish that makes the whole kitchen smell amazing.",
    "prepTime": "10 min",
    "cookTime": "60 min",
    "servings": "4 servings",
    "image": "https://www.feastingathome.com/wp-content/uploads/2024/09/Tomato-Confit-6.jpg",
    "tags": [],
    "ingredients": [
      "2 pints cherry tomatoes, grape tomatoes, yellow pear tomatoes or a mix (about 4 cups)",
      "¼ cup extra virgin olive oil (please see notes)",
      "¾ teaspoon salt, more to taste",
      "½ teaspoon black pepper",
      "6-8 fat garlic cloves, smashed",
      "Optional: 4-5 fresh thyme sprigs (or sub oregano) and 8-10 fresh basil leaves, a splash of balsamic vinegar"
    ],
    "instructions": [
      "Preheat the oven to 350 F",
      "Place the tomatoes and smashed fresh garlic cloves in a mostly single layer in a 9×13 inch baking dish, 11-inch braiser, or oven-proof skillet.",
      "Add the olive oil ( see notes) and thyme sprigs and season with salt and pepper. Cover tightly with a lid or with foil.",
      "Bake for 60 minutes, giving the pan a little shake halfway through. At 60 minutes, the tomatoes should have collapsed slightly, and the garlic should be caramelized. If you like them a little more caramelized, roast uncovered for 10-15 more minutes. If preserving for later, add ¼ cup more oil to the pan. Remove from oven and let cool for 10 minutes before adding basil leaves.",
      "Taste, adjust salt and pepper.",
      "Serve right away (with a drizzle of balsamic if you like) or store in an airtight container or jar for up to 2 weeks in the refrigerator, covered with the reserved oil. If the tomatoes are exposed to air, they can mold, so be sure to sink them down."
    ],
    "notes": "",
    "sourceUrl": "https://www.feastingathome.com/tomato-confit/#tasty-recipes-80247-jump-target",
    "dateAdded": "2025-10-26"
  },
  {
    "id": "small-batch-chocolate-chip-cookies",
    "title": "Small Batch Chocolate Chip Cookies",
    "description": "I’ve made this one MANY times! Try underbaking the dough a little. YUM",
    "prepTime": "30 min",
    "cookTime": "15 min",
    "servings": "8",
    "image": "https://freshbeanbakery.com/wp-content/uploads/2024/04/IMG_5466.jpg",
    "tags": [],
    "ingredients": [
      "113 g unsalted butter ((8 tbsp.))",
      "100 g dark brown sugar* ((½ c.))",
      "50 g granulated sugar ((¼ c.))",
      "1  egg (room temperature)",
      "½ tsp. vanilla",
      "160 g all purpose flour ((1 ⅓ c.))",
      "¾ tsp. baking powder",
      "¼ tsp. baking soda",
      "½ tsp. salt",
      "150 g semi-sweet chocolate** ( (¾ c. + 2 tbsp.))"
    ],
    "instructions": [
      "In a small saucepan set over medium heat, brown the butter. Stir the butter occasionally until it turns amber in color and develops little brown specks.",
      "Transfer the brown butter to a medium sized mixing bowl and set it in the freezer for 5 minutes to chill. You should be left with at least 90g of brown butter, if you have a little less, just add in some water until you reach 90g.",
      "Once the butter has cooled down a bit, whisk in both sugars.",
      "Whisk in the egg and vanilla until well combined.",
      "Add in the flour, baking powder, baking soda, and salt. Use a rubber spatula to fold the mixture together just until a few flour streaks remain.",
      "Add in the chocolate and fold the mixture together just until no flour streaks remain. Cover the bowl tightly with plastic wrap and place it in the fridge for 30 minutes to firm up.***",
      "Preheat the oven to 350°F / 175°C.",
      "Scoop out heaping 3 tbsp. scoops of the cookie dough. (If you chilled the dough for longer, you may need to wait 10-20 minutes for it to become soft enough to scoop.)",
      "Evenly space out the cookie dough balls on a parchment lined cookie sheet and top them with extra chocolate.",
      "Bake for 12-14 minutes, or until the edges of the cookies start to turn golden brown.",
      "Once the cookies come out of the oven, I recommend &quot;scooting&quot; them. This just means take a bowl, cup, or biscuit cutter that is slightly larger than the cookie, place it on top of the cookie, and swirl the bowl around to make the cookie a little more round.",
      "Let the cookies sit on the hot baking tray for at least 5 minutes before transferring them to a wire rack to cool.  Sprinkle with flaky sea salt, serve and enjoy!"
    ],
    "notes": "",
    "sourceUrl": "https://freshbeanbakery.com/small-batch-brown-butter-chocolate-chip-cookies/",
    "dateAdded": "2025-10-26"
  },
  {
    "id": "banana-muffins",
    "title": "Banana Muffins",
    "description": "A little taste of home — my take on the classic Starbucks Thailand banana muffin, made extra soft and aromatic with oil instead of butter. Simple, nostalgic, and perfect with coffee.",
    "prepTime": "1h",
    "cookTime": "20-30 min",
    "servings": "5",
    "image": "https://i.imgur.com/u3BRz7q.jpeg",
    "tags": [],
    "ingredients": [
      "2 large eggs",
      "70 g granulated sugar",
      "30 g brown sugar",
      "150 g ripe banana (about 1–1½ medium bananas), mashed",
      "50 g whole milk",
      "¼ tsp salt",
      "100 g neutral oil (such as canola or grapeseed)",
      "150 g all-purpose flour",
      "1 tsp baking powder",
      "¼ tsp baking soda",
      "Optional: 50–70 g semi-sweet chocolate chips"
    ],
    "instructions": [
      "Mash the banana: In a large bowl, mash the ripe banana until smooth.",
      "Combine wet ingredients: Add the eggs, granulated sugar, and brown sugar. Whisk until well combined. Stir in the milk, salt, and oil.",
      "Add dry ingredients: Sift in the flour, baking powder, and baking soda. Mix gently until just combined — do not overmix.",
      "Optional: Fold in chocolate chips if using.",
      "Chill the batter: Cover and refrigerate for 1–2 hours. This helps the muffins rise higher and improves texture.",
      "Preheat and bake: Preheat oven to 425 °F (220 °C). For muffins or cupcakes: Line a muffin tin with paper cups and fill each about ¾ full. Bake for 18–22 minutes, until golden and a toothpick inserted in the center comes out clean. For a loaf: Line the pan with parchment paper. Bake at 425 °F (220 °C), covering loosely with foil for the first 10 minutes to prevent over-browning. Continue baking until a toothpick inserted in the center comes out clean.",
      "Cool: Let cool in the pan for 5 minutes, then transfer to a wire rack to cool completely."
    ],
    "notes": "",
    "sourceUrl": "",
    "dateAdded": "2025-10-26"
  },
  {
    "id": "air-fryer-chicken-wings",
    "title": "Air Fryer Chicken Wings",
    "description": "Smoke and oil splashing during air frying chicken wings is not pleasant so this recipe came from my own trial and error.",
    "prepTime": "15 min",
    "cookTime": "45 min",
    "servings": "2",
    "image": "",
    "tags": [],
    "ingredients": [
      "10 chicken wings",
      "Neutral cooking oil",
      "½ tsp salt",
      "¼ tsp garlic powder",
      "¼ tsp ground pepper"
    ],
    "instructions": [
      "Preheat the toaster oven using the Air Fryer function to 380°F.",
      "Cover the baking tray with foil to collect dripping chicken fat. This helps reduce smoking in the toaster oven.",
      "Pat dry the chicken wings. Allowing the chicken to come closer to room temperature helps them cook evenly and prevents overcooking.",
      "Lightly rub the wings with oil.",
      "Coat the wings with the seasoning mix (salt, garlic powder, and ground pepper).",
      "Spray the air fryer rack with oil to prevent sticking, then place the wings on the rack.",
      "Bake for 25 minutes, flipping the wings halfway through.",
      "Increase the temperature to 400°F and bake for an additional 5 minutes."
    ],
    "notes": "",
    "sourceUrl": "",
    "dateAdded": "2025-10-27"
  },
  {
    "id": "simple-milk-foam-for-homemade-latte-art",
    "title": "Simple Milk Foam for Homemade Latte Art",
    "description": "I took a latte art class, so I hope these instructions (which work for me) work for you too! #homebarista #latteart",
    "prepTime": "5 min",
    "cookTime": "5 min",
    "servings": "1",
    "image": "https://i.imgur.com/OCs6iD6.jpeg",
    "tags": [],
    "ingredients": [
      "Whole milk (cold)",
      "Milk pitcher",
      "Espresso with good crema"
    ],
    "instructions": [
      "Submerge the steam-wand tip slightly and tilt the pitcher.",
      "Aerate the cold milk until it reaches 90–100°F. If a thermometer is not available, stop aerating when: the pitcher feels warm to the touch, or the desired foam height is reached.",
      "Slowly move the pitcher up to submerge the wand tip slightly (no more aerating just texturing).",
      "Stop steaming once the milk reaches 135–140°F or feels too hot to touch.",
      "If bubbles remain, tap the pitcher gently to break them, then swirl to incorporate the foam evenly.",
      "Pour immediately."
    ],
    "notes": "",
    "sourceUrl": "",
    "dateAdded": "2025-10-27"
  }
]